app/Controllers/AuthController.php

SELECT *
FROM `prefixe`
---
    public function index()
    {
        $prefixeModel = new PrefixeModel();
        $data['prefixes'] = $prefixeModel->findAll();

SELECT *
FROM `compte`
WHERE `tel` = '121302890'
 LIMIT 1
INSERT INTO `compte` (`tel`) VALUES ('121302890')
---
    public function dashboard()
    {
        $session = session();
        $compteModel = new CompteModel();
        $operationModel = new OperationModel();

        $phone = $this->request->getPost('phone');
        $prefixe = $this->request->getPost('prefixe');

        if ($prefixe && $phone) {
            $fullPhone = $prefixe . $phone;
            $compte = $compteModel->where('tel', $fullPhone)->first();

            if (! $compte) {
                $compteId = $compteModel->insert(['tel' => $fullPhone]);

SELECT `operation`.*, `t`.`label` as `type_label`
FROM `operation`
JOIN `type_operation` `t` ON `operation`.`id_type` = `t`.`id`
WHERE   (
`operation`.`id_compte1` = 1
OR `operation`.`id_compte2` = 1
 )
ORDER BY `date_track` DESC
---

        $idCompte = $compteSession['id'];
        $data['soldeCompte'] = $operationModel->getSolde($idCompte);
        $data['operations'] = $operationModel
            ->select('operation.*, t.label as type_label')
            ->join('type_operation t', 'operation.id_type = t.id')
            ->groupStart()
                ->where('operation.id_compte1', $idCompte)
                ->orWhere('operation.id_compte2', $idCompte)
            ->groupEnd()
            ->orderBy('date_track', 'DESC')
            ->findAll();