app/Controllers/FraisController.php

        function listOperation() {
            $typeOperationModel = new TypeOperationModel();
            $data['operations'] = $typeOperationModel->findAll();
---
SELECT *
FROM `type_operation`