app/Controllers/FraisController.php

SELECT *
FROM `type_operation`
WHERE `label` != 'depot'
---
        function listOperation() {
            $typeOperationModel = new TypeOperationModel();
            $data['operations'] = $typeOperationModel->where('label !=', 'depot')->findAll();

SELECT *
FROM `tranche`
WHERE `id_type` = '1'
---
        function list($idType) {
            $trancheModel = new TrancheModel();
            $data['list'] = $trancheModel->where("id_type", $idType)->findAll();