app/Controllers/OperationController.php

    public function transactions(){
        $prefixeModel = new PrefixeModel();
        $data['prefixes'] = $prefixeModel->findAll();
---
SELECT *
FROM `prefixe`

    protected function resolveDestinataireId(?int $compte2Id, ?string $prefix, ?string $phone)
    {
        if ($compte2Id !== null && $compte2Id > 0) {
            return $compte2Id;
        }

        $prefix = $this->normalizePrefix($prefix);
        $phone = preg_replace('/\D/', '', (string) $phone);

        if (empty($prefix) || empty($phone)) {
            return 'Le préfixe et le numéro destinataire sont requis.';
        }

        if (strlen($phone) !== 10) {
            return 'Le numéro destinataire doit contenir exactement 10 chiffres.';
        }

        $prefixeModel = new PrefixeModel();
        $prefixe = $prefixeModel->where('label', $prefix)->first();

        if (! $prefixe) {
            $prefixeId = $prefixeModel->insert(['label' => $prefix]);
            if (! $prefixeId) {
                return 'Impossible d\'enregistrer le préfixe destinataire.';
            }
        }

        $compteModel = new CompteModel();
        $destinataire = $compteModel->where('tel', $phone)->first();
---
SELECT *
FROM `prefixe`
WHERE `label` = '032'
 LIMIT 1
SELECT *
FROM `compte`
WHERE `tel` = '2130289000'
 LIMIT 1

            return (int) $destinataire['id'];
        }

        $newId = $compteModel->insert(['tel' => $phone]);
---
INSERT INTO `compte` (`tel`) VALUES ('2130289000')