app/Controllers/PrefixeController.php

        function addPrefix() {
            $data = $this->request->getPost();
            $prefix = new PrefixeModel();
            if(!$prefix->save($data)) {
                return redirect()->back()->with('errors', $prefix->errors());
---
SELECT *
FROM `prefixe`