app/Models/OperationModel.php

    public function getSolde($idCompte){
        $depots = $this->db->table('operation o')
            ->selectSum('o.montant')->join('type_operation t', 't.id = o.id_type')
            ->where('t.label', self::TYPE_DEPOT)->where('o.id_compte1', $idCompte)
            ->get()->getRow()->montant ?? 0;

        $transfertsRecus = $this->db->table('operation o')
            ->selectSum('o.montant')->join('type_operation t', 't.id = o.id_type')
            ->where('t.label', self::TYPE_TRANSFERT)->where('o.id_compte2', $idCompte)
            ->get()->getRow()->montant ?? 0;

        $sorties = $this->db->table('operation o')
            ->select('SUM(o.montant) + SUM(COALESCE(o.frais, 0)) as total_sorties')
            ->join('type_operation t', 't.id = o.id_type')
            ->whereIn('t.label', [self::TYPE_RETRAIT, self::TYPE_TRANSFERT])
            ->where('o.id_compte1', $idCompte)
            ->get()->getRow()->total_sorties ?? 0;
---
SELECT SUM(`montant`) AS `montant`
FROM `operation`
JOIN `type_operation` `t` ON `operation`.`id_type` = `t`.`id`
WHERE   (
`t`.`label` = 'retrait'
AND `operation`.`id_compte1` = 1
OR `t`.`label` = 'transfert'
OR `operation`.`id_compte1` = 1
 )
SELECT SUM(`montant`) AS `montant`
FROM `operation`
JOIN `type_operation` `t` ON `operation`.`id_type` = `t`.`id`
WHERE   (
`t`.`label` = 'depot'
AND `operation`.`id_compte1` = 1
OR `t`.`label` = 'transfert'
OR `operation`.`id_compte2` = 1
 )
SELECT SUM(`o`.`montant`) AS `montant`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type`
WHERE   (
`t`.`label` = 'depot'
AND `o`.`id_compte1` = 1
OR `t`.`label` = 'transfert'
OR `o`.`id_compte2` = 1
 )

    public function getHistorique($idCompte, $limit = null, $offset = 0)
    {
        $b = $this->db->table('operation o')
            ->select('o.*, t.label as type_label, c1.tel as tel_compte1, c2.tel as tel_compte2')
            ->join('type_operation t', 't.id = o.id_type')
            ->join('compte c1', 'c1.id = o.id_compte1')
            ->join('compte c2', 'c2.id = o.id_compte2', 'left')
            ->groupStart()->where('o.id_compte1', $idCompte)->orWhere('o.id_compte2', $idCompte)->groupEnd()
            ->orderBy('o.date_track', 'DESC')->orderBy('o.id', 'DESC');
        return $limit ? $b->limit($limit, $offset)->get()->getResultArray() : $b->get()->getResultArray();
---
SELECT `o`.*, `t`.`label` as `type_label`, `c1`.`tel` as `tel_compte1`, `c2`.`tel` as `tel_compte2`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type`
JOIN `compte` `c1` ON `c1`.`id` = `o`.`id_compte1`
LEFT JOIN `compte` `c2` ON `c2`.`id` = `o`.`id_compte2`
WHERE   (
`o`.`id_compte1` = 1
OR `o`.`id_compte2` = 1
 )
ORDER BY `o`.`date_track` DESC, `o`.`id` DESC
 LIMIT 5

    public function countHistorique($idCompte)
    {
        return (int) $this->db->table('operation o')
            ->join('type_operation t', 't.id = o.id_type')
            ->groupStart()->where('o.id_compte1', $idCompte)->orWhere('o.id_compte2', $idCompte)->groupEnd()
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type`
JOIN `compte` `c1` ON `c1`.`id` = `o`.`id_compte1`
LEFT JOIN `compte` `c2` ON `c2`.`id` = `o`.`id_compte2`
WHERE   (
`o`.`id_compte1` = 1
OR `o`.`id_compte2` = 1
 )