app/Models/OperationModel.php

    public function getSolde(int $idCompte): float
    {
        $entrees = $this->db->table('operation o')
            ->selectSum('o.montant')
            ->join('type_operation t', 't.id = o.id_type')
            ->groupStart()
                ->where(['t.label' => self::TYPE_DEPOT, 'o.id_compte1' => $idCompte])
                ->orWhere(['t.label' => self::TYPE_TRANSFERT, 'o.id_compte2' => $idCompte])
            ->groupEnd()
            ->get()
            ->getRow()
            ->montant ?? 0;

        $sorties = $this->db->table('operation o')
            ->selectSum('o.montant')
            ->join('type_operation t', 't.id = o.id_type')
            ->groupStart()
                ->where(['t.label' => self::TYPE_RETRAIT, 'o.id_compte1' => $idCompte])
                ->orWhere(['t.label' => self::TYPE_TRANSFERT, 'o.id_compte1' => $idCompte])
            ->groupEnd()
            ->get()
            ->getRow()
            ->montant ?? 0;
---
SELECT SUM(`o`.`montant`) AS `montant`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type`
WHERE   (
`t`.`label` = 'retrait'
AND `o`.`id_compte1` = 1
OR `t`.`label` = 'transfert'
OR `o`.`id_compte1` = 1
 )