app/Models/TrancheModel.php

SELECT COUNT(*) AS `numrows`
FROM `tranche`
WHERE `id_type` = '1'
AND `id` != '1'
AND   (
`montant1` <= '502'
AND `montant2` >= '0'
 )
---
        public function isIntervalOverlapping($montant1, $montant2, $id_type, $excludeId = null): bool {
            $builder = $this->builder();

            $builder->where('id_type', $id_type);

            if ($excludeId !== null) {
                $builder->where('id !=', $excludeId);
            }

            $builder->groupStart()
                    ->where('montant1 <=', $montant2)
                    ->where('montant2 >=', $montant1)
                    ->groupEnd();

            return $builder->countAllResults() > 0;